// Модель данных (Model в паттерне MVC)
// Коллекция mock-объектов персонажей для эмуляции ответа от сервера/базы данных
export const characters = [
    { 
        id: 1,
        name: "Hello Kitty",
        category: "кошечка",
        src: "images/hello kitty.webp",
        shortDesc: "Добрая и искренняя девочка с фирменным красным бантиком, обожающая печь яблочные пироги!",
        birthday: "1 ноября",
        hobby: "Выпечка сладостей, чтение добрых книжек, коллекционирование милых вещей и путешествия",
        quote: "Hello Kitty напоминает, что друзей никогда не бывает слишком много!"
    },
    {
        id: 2,
        name: "Kuromi",
        category: "зайка",
        src: "images/kuromi.webp",
        shortDesc: "Озорная бунтарка в чёрной шутовской шапочке с розовым черепом, обожающая романтику",
        birthday: "31 октября",
        hobby: "Флирт, полеты в Баку, записи в блокнотик, провокации My Melody, шалости (иногда)",
        quote: "Заметка Куроми: Будь смелой, будь собой и никогда не сдавайся!"
    },
    {
        id: 3,
        name: "Cinnamoroll",
        category: "собачка",
        src: "images/cinamonroll.webp",
        shortDesc: "Белый пушистый щенок с длинными ушками, который умеет парить в воздухе, как облачко",
        birthday: "6 марта",
        hobby: "Веселье с друзьями, спорт, отдых, переодевания, еда, творить и создавать, безделье",
        quote: "Пожелание Cinnamoroll: пусть сегодняшний день будет мягким и сладким, как булочка с корицей!"
    },
    {
        id: 4,
        name: "My Melody",
        category: "зайка",
        src: "images/my melody.webp",
        shortDesc: "Невероятно милая и искренняя белая крольчиха в розовом капюшоне, лучшая подружка Hello Kitty",
        birthday: "18 января",
        hobby: "Выпечка печенья вместе с мамой, поедание миндального пирога и милые вещи",
        quote: "Послание от My Melody: Доброта и забота о близких могут растопить любое сердечко!"
    }

]